{
    "index" : 4,
    "text" : "<p>Rob Carr, 56, knew at a young age that the simple life was the life for him. He says by the time he was 14 years old he knew he didn\"t want to live in the city.</p><p>Carr grew up just outside of Washington, D.C. He went to the University of Maryland for a degree in agriculture and eventually got a job with the Department of Agriculture, which brought him to Canton.</p><p>Carr worked at a dairy farm down the road from Birdsfoot for nine years. During that time he got to know the residents of the community. He was even hired to help build one of the houses on the property.</p><p>Carr met his wife Patreesha, and together they have a daughter named Brigit who is away at college. His marriage was what brought him into Birdsfoot.</p><p>\"I married into it, which is a common way people have gotten into the community,\" says Carr. \"It's been a wonderful place to live and raise our daughter.\"</p><p>Living in a community is bound to have its challenges. Carr says trying to manage a full time job as a physical therapy assistant, community duties, and family time can be difficult.</p><p>\"The big challenge is balancing community time with personal time,\" he says. \"There's quite often a rub of that, and trying to balance that is a little tricky sometimes.\"</p><p>As one of the few agriculturally based intentional communities, Carr is proud of their commitment to healthy living and leaving a small footprint.</p><p>\"A big part of what we do here has to do with trying to eat well,\" says Carr. \"One big thing is we kind of offer an alternative approach to living sustainably.\"</p><p>When he's not working, Carr takes part in a local acapella group. (To hear Rob sing a pagan chant, click here: <a id=\"rob-play-pause\" onclick=\"toggleRobSing()\">Play</a>)</p><p>Living at Birdsfoot is the life Carr wants to live.</p><p>\"I think its important and valuable to just get to know a place well,\" says Carr. \"You have a different relationship.\"</p><p>\"We probably are just a little hippie farm,\" Carr says laughing.</p>"
}